JayHeng/RT-MFB/boards/mimxrt/mfb_fw/imxrt1189/cm33/port_flexspi_info.h
/*
 * Copyright 2018-2020 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef _PORT_FLEXSPI_INFO_H_
#define _PORT_FLEXSPI_INFO_H_

#include "fsl_clock.h"
#include "fsl_iomuxc.h"
#include "fsl_cache.h"
#include "fsl_rgpio.h"
#include "fsl_flexspi.h"
#include "mfb.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define EXAMPLE_FLEXSPI                 FLEXSPI1
#define FLASH_SIZE                      0x4000 /* 16Mb/KByte */
#define EXAMPLE_FLEXSPI_AMBA_BASE       FlexSPI1_AMBA_BASE
#define FLASH_PAGE_SIZE                 256
#define SECTOR_SIZE                     0x1000 /* 4K */
#define EXAMPLE_FLEXSPI_CLOCK           kCLOCK_Flexspi1
#define FLASH_PORT                      kFLEXSPI_PortA1

//#define BOARD_IS_RT1180_EVK_PORTA_QUAD      (0)
//#define BOARD_IS_RT1180_EVK_PORTA_OCTAL     (0)
#define BOARD_IS_RT1180_EVK_PORTB_QUAD      (0)
#define BOARD_IS_RT1180_EVK_PORTB_OCTAL     (0)  // To Flash memory daughter card

#define BOARD_IS_RT1180_MEM_DC_MUX1         (1)
#define BOARD_IS_RT1180_MEM_DC_MUX2         (0)
#define BOARD_IS_RT1180_MEM_DC_MUX3         (0)

/*
 * If cache is enabled, this example should maintain the cache to make sure
 * CPU core accesses the memory, not cache only.
 */
#define CACHE_MAINTAIN 1

/*${macro:end}*/

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*${variable:start}*/
#if (defined CACHE_MAINTAIN) && (CACHE_MAINTAIN == 1)
typedef struct _flexspi_cache_status
{
    volatile bool codeCacheEnableFlag;
    volatile bool systemCacheEnableFlag;
} flexspi_cache_status_t;
#endif
/*${variable:end}*/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

static void cpu_show_clock_source(void)
{
#if MFB_DEBUG_LOG_INFO_ENABLE
    uint32_t clkSel = CLOCK_GetRootClockMux(kCLOCK_Root_M33);
    switch (clkSel)
    {
        case kCLOCK_M33_ClockRoot_MuxOscRc24M:
            mfb_printf("MFB: CPU-CM33 Clk Source from 2'b00 - OSC RC24M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_Osc24M));
            break;

        case kCLOCK_M33_ClockRoot_MuxOscRc400M:
            mfb_printf("MFB: CPU-CM33 Clk Source from 2'b01 - OSC RC400M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_OscRc400M));
            break;

        case kCLOCK_M33_ClockRoot_MuxSysPll3Out:
            mfb_printf("MFB: CPU-CM33 Clk Source from 2'b10 - Sys PLL3 clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_SysPll3Out));
            break;

        case kCLOCK_M33_ClockRoot_MuxArmPllOut:
            mfb_printf("MFB: CPU-CM33 Clk Source from 2'b11 - ARM PLL clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_ArmPllOut));
            break;

        default:
            break;
    }

    uint32_t clkDiv = CLOCK_GetRootClockDiv(kCLOCK_Root_M33);
    mfb_printf("MFB: CPU-CM33 Clk Source Divider: %d.\r\n", clkDiv);
    mfb_printf("MFB: CPU-CM33 Clk Frequency: %dHz.\r\n", CLOCK_GetFreq(kCLOCK_CpuClk));
#endif
}

static void flexspi_port_switch(FLEXSPI_Type *base, flexspi_port_t port, flexspi_pad_t pads)
{
    rgpio_pin_config_t do_config = {kRGPIO_DigitalOutput, 0};
    if (base == FLEXSPI1)
    {
#if BOARD_IS_RT1180_MEM_DC_MUX1 | BOARD_IS_RT1180_MEM_DC_MUX2
        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_23_GPIO4_IO23, 0U);
        RGPIO_PinInit(RGPIO4, 23, &do_config);
#endif
#if BOARD_IS_RT1180_EVK_PORTB_QUAD | BOARD_IS_RT1180_EVK_PORTB_OCTAL
        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_04_GPIO4_IO04, 0U);
        RGPIO_PinInit(RGPIO4, 4, &do_config);
#endif
        switch (port)
        {
            case kFLEXSPI_PortA1:
            case kFLEXSPI_PortA2:
                RGPIO_PinWrite(RGPIO4, 23, 0);
                break;
            case kFLEXSPI_PortB1:
            case kFLEXSPI_PortB2:
#if BOARD_IS_RT1180_MEM_DC_MUX1
                RGPIO_PinWrite(RGPIO4, 23, 0);
#elif BOARD_IS_RT1180_MEM_DC_MUX2
                RGPIO_PinWrite(RGPIO4, 23, 1);
#endif
#if BOARD_IS_RT1180_EVK_PORTB_QUAD
                RGPIO_PinWrite(RGPIO4, 4, 0);
#elif BOARD_IS_RT1180_EVK_PORTB_OCTAL
                RGPIO_PinWrite(RGPIO4, 4, 1);
#endif
                break;
            default:
                break;
        }
    }
    else if (base == FLEXSPI2)
    {
#if BOARD_IS_RT1180_MEM_DC_MUX1 | BOARD_IS_RT1180_MEM_DC_MUX2 | BOARD_IS_RT1180_MEM_DC_MUX3
        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_22_GPIO4_IO22, 0U);
        RGPIO_PinInit(RGPIO4, 22, &do_config);
#endif
        switch (port)
        {
            case kFLEXSPI_PortA1:
            case kFLEXSPI_PortA2:
#if BOARD_IS_RT1180_MEM_DC_MUX1
                RGPIO_PinWrite(RGPIO4, 22, 0);
#elif BOARD_IS_RT1180_MEM_DC_MUX2
                RGPIO_PinWrite(RGPIO4, 22, 1);
#endif
                break;
            case kFLEXSPI_PortB1:
            case kFLEXSPI_PortB2:
#if BOARD_IS_RT1180_MEM_DC_MUX1
                RGPIO_PinWrite(RGPIO4, 22, 0);
#elif BOARD_IS_RT1180_MEM_DC_MUX2 | BOARD_IS_RT1180_MEM_DC_MUX3
                RGPIO_PinWrite(RGPIO4, 22, 1);
#endif
                break;
            default:
                break;
        }
    }
    else
    {
    }
}

static void flexspi_pin_init(FLEXSPI_Type *base, flexspi_port_t port, flexspi_pad_t pads)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
    CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */
    if (base == FLEXSPI1)
    {
        switch (port)
        {
            case kFLEXSPI_PortA1:
            case kFLEXSPI_PortA2:
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_07_FLEXSPI1_BUS2BIT_A_DQS,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_08_FLEXSPI1_BUS2BIT_A_SCLK,   1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_09_FLEXSPI1_BUS2BIT_A_SS0_B,  1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_10_FLEXSPI1_BUS2BIT_A_DATA00, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_11_FLEXSPI1_BUS2BIT_A_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_12_FLEXSPI1_BUS2BIT_A_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_13_FLEXSPI1_BUS2BIT_A_DATA03, 1U);

                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_03_FLEXSPI1_BUS2BIT_A_DATA04, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_04_FLEXSPI1_BUS2BIT_A_DATA05, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_05_FLEXSPI1_BUS2BIT_A_DATA06, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_06_FLEXSPI1_BUS2BIT_A_DATA07, 1U);
                break;
            case kFLEXSPI_PortB1:
            case kFLEXSPI_PortB2:
#if BOARD_IS_RT1180_MEM_DC_MUX1 | BOARD_IS_RT1180_EVK_PORTB_QUAD | BOARD_IS_RT1180_EVK_PORTB_OCTAL
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_05_FLEXSPI1_BUS2BIT_B_DQS,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_06_FLEXSPI1_BUS2BIT_B_SS0_B,  1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_07_FLEXSPI1_BUS2BIT_B_SCLK,   1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_08_FLEXSPI1_BUS2BIT_B_DATA00, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_09_FLEXSPI1_BUS2BIT_B_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_10_FLEXSPI1_BUS2BIT_B_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_11_FLEXSPI1_BUS2BIT_B_DATA03, 1U);
                
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_00_FLEXSPI1_BUS2BIT_B_DATA04, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_01_FLEXSPI1_BUS2BIT_B_DATA05, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_02_FLEXSPI1_BUS2BIT_B_DATA06, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_03_FLEXSPI1_BUS2BIT_B_DATA07, 1U);
#elif BOARD_IS_RT1180_MEM_DC_MUX2
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_03_FLEXSPI1_BUS2BIT_B_DQS,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_04_FLEXSPI1_BUS2BIT_B_SS0_B,  1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_05_FLEXSPI1_BUS2BIT_B_SCLK,   1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_13_FLEXSPI1_BUS2BIT_B_DATA00, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_12_FLEXSPI1_BUS2BIT_B_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_11_FLEXSPI1_BUS2BIT_B_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_10_FLEXSPI1_BUS2BIT_B_DATA03, 1U);
                
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_09_FLEXSPI1_BUS2BIT_B_DATA04, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_08_FLEXSPI1_BUS2BIT_B_DATA05, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_07_FLEXSPI1_BUS2BIT_B_DATA06, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_06_FLEXSPI1_BUS2BIT_B_DATA07, 1U);
#endif
                break;
            default:
                break;
        }

