JayHeng/RT-MFB/boards/mimxrt/mfb_fw/imxrt1189/cm33/port_flexspi_info.h
    }
    else if (base == FLEXSPI2)
    {
        switch (port)
        {
            case kFLEXSPI_PortA1:
            case kFLEXSPI_PortA2:
            case kFLEXSPI_PortB1:
            case kFLEXSPI_PortB2:
#if BOARD_IS_RT1180_MEM_DC_MUX1
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_35_FLEXSPI2_BUS2BIT_A_DATA00, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_36_FLEXSPI2_BUS2BIT_A_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_37_FLEXSPI2_BUS2BIT_A_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_38_FLEXSPI2_BUS2BIT_A_DATA03, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_39_FLEXSPI2_BUS2BIT_A_SS0_B,  1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_40_FLEXSPI2_BUS2BIT_A_DQS,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_41_FLEXSPI2_BUS2BIT_A_SCLK,   1U);

                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_28_FLEXSPI2_BUS2BIT_B_SS0_B,  1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_29_FLEXSPI2_BUS2BIT_B_DQS,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_30_FLEXSPI2_BUS2BIT_B_DATA03, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_31_FLEXSPI2_BUS2BIT_B_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_32_FLEXSPI2_BUS2BIT_B_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_33_FLEXSPI2_BUS2BIT_B_DATA00, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_34_FLEXSPI2_BUS2BIT_B_SCLK,   1U);
#elif BOARD_IS_RT1180_MEM_DC_MUX2
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_21_FLEXSPI2_BUS2BIT_A_DQS,       1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_22_FLEXSPI2_BUS2BIT_A_SS0_B,     1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_23_FLEXSPI2_BUS2BIT_A_SCLK,      1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_24_FLEXSPI2_BUS2BIT_A_DATA00,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_25_FLEXSPI2_BUS2BIT_A_DATA01,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_26_FLEXSPI2_BUS2BIT_A_DATA02,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_27_FLEXSPI2_BUS2BIT_A_DATA03,    1U);

#if BOARD_IS_RT1180_MEM_DC_MUX3
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_22_FLEXSPI2_BUS2BIT_B_DATA03, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_23_FLEXSPI2_BUS2BIT_B_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_24_FLEXSPI2_BUS2BIT_B_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_25_FLEXSPI2_BUS2BIT_B_DATA00, 1U);
#else
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_15_FLEXSPI2_BUS2BIT_B_DATA03, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_16_FLEXSPI2_BUS2BIT_B_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_17_FLEXSPI2_BUS2BIT_B_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_18_FLEXSPI2_BUS2BIT_B_DATA00, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_19_FLEXSPI2_BUS2BIT_B_SCLK,   1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_20_FLEXSPI2_BUS2BIT_B_DQS,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_21_FLEXSPI2_BUS2BIT_B_SS0_B,  1U);
#endif
#elif BOARD_IS_RT1180_MEM_DC_MUX3
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_28_FLEXSPI2_BUS2BIT_B_SS0_B,  1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_19_FLEXSPI2_BUS2BIT_B_SCLK,   1U);

                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_21_FLEXSPI2_BUS2BIT_B_DQS,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_22_FLEXSPI2_BUS2BIT_B_DATA03, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_23_FLEXSPI2_BUS2BIT_B_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_24_FLEXSPI2_BUS2BIT_B_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_25_FLEXSPI2_BUS2BIT_B_DATA00, 1U);
#endif
                break;
            default:
                break;
        }
    }
    else
    {
    }
}

static void flexspi_clock_init(FLEXSPI_Type *base, flexspi_root_clk_freq_t clkFreq)
{
    clock_root_config_t rootCfg = {0};
    if (base == FLEXSPI1)
    {
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 12-35.
        if (clkFreq == kFlexspiRootClkFreq_30MHz)
        {
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc24M;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_50MHz)
        {
            /* Init System Pll2 (528MHz) pfd0. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd0, 24);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd0;
            rootCfg.div = 8;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_60MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 18);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 8;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_80MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 18);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 6;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_100MHz)
        {
            /* Init System Pll2 (528MHz) pfd0. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd0, 32);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd0;
            rootCfg.div = 3;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_120MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 18);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 4;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_133MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            // CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 22);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 3;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_166MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 26);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_200MHz)
        {
            /* Init System Pll2 (528MHz) pfd0. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd0, 24);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd0;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_240MHz)
        {
            /* Init System Pll2 (528MHz) pfd0. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd0, 20);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd0;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_266MHz)
        {
            /* Init System Pll2 (528MHz) pfd0. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd0, 35);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd0;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_332MHz)
        {
            /* Init System Pll2 (528MHz) pfd0. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd0, 28);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd0;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_400MHz)
        {
            /* Init System Pll2 (528MHz) pfd0. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd0, 24);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd0;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else
        {
            mfb_printf("MFB: This FlexSPI clock freq is not set.\r\n");
        }
    }
    else if (base == FLEXSPI2)
    {
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 12-35.
        if (clkFreq == kFlexspiRootClkFreq_30MHz)
        {
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxOscRc24M;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_50MHz)
        {
            /* Init System Pll2 (528MHz) pfd1. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd1, 24);
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Pfd1;
            rootCfg.div = 8;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_60MHz)
        {
            /* Init System Pll3 (480MHz) pfd2. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd2, 18);
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
            rootCfg.div = 8;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_80MHz)
        {
            /* Init System Pll3 (480MHz) pfd2. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd2, 18);
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
            rootCfg.div = 6;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_100MHz)
        {
            /* Init System Pll2 (528MHz) pfd1. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            // CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd1, 16);
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Pfd1;
            rootCfg.div = 6;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_120MHz)
        {
            /* Init System Pll3 (480MHz) pfd2. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd2, 18);
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
            rootCfg.div = 4;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_133MHz)
        {
            /* Init System Pll3 (480MHz) pfd2. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd2, 22);
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
            rootCfg.div = 3;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_166MHz)
        {
            /* Init System Pll3 (480MHz) pfd2. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            // CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd2, 26);
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_200MHz)
        {
            /* Init System Pll2 (528MHz) pfd1. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd1, 24);
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Pfd1;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_240MHz)
        {
            /* Init System Pll3 (480MHz) pfd2. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd2, 18);
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_266MHz)
        {
            /* Init System Pll2 (528MHz) pfd1. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd1, 18);
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Pfd1;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_332MHz)
        {
            /* Init System Pll2 (528MHz) pfd1. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd1, 28);
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Pfd1;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kFlexspiRootClkFreq_400MHz)
        {
            /* Init System Pll2 (528MHz) pfd1. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd1, 24);
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Pfd1;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else
        {
            mfb_printf("MFB: This FlexSPI clock freq is not set.\r\n");
        }
    }
    else
    {
    }
}

static uint32_t flexspi_get_clock(FLEXSPI_Type *base)
{
    if (base == FLEXSPI1)
    {
        return CLOCK_GetRootClockFreq(kCLOCK_Root_Flexspi1);
    }
    else if (base == FLEXSPI2)
    {
        return CLOCK_GetRootClockFreq(kCLOCK_Root_Flexspi2);
    }
    else
    {
        return 0;
    }
}

static void flexspi_show_clock_source(FLEXSPI_Type *base)
{
#if MFB_DEBUG_LOG_INFO_ENABLE
    uint32_t index = 0;
    clock_root_t root;
    uint32_t clkSel;
    if (base == FLEXSPI1)
    {
        root = kCLOCK_Root_Flexspi1;
        clkSel = CLOCK_GetRootClockMux(root);
        switch (clkSel)
        {
            case kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc24M:
                mfb_printf("MFB: FLEXSPI1 Clk Source from 2'b00 - OSC RC24M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_Osc24M));
                break;

            case kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc400M:
                mfb_printf("MFB: FLEXSPI1 Clk Source from 2'b01 - OSC RC400M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_OscRc400M));
                break;

